EDT/УТ/src/Documents/КадровоеПеремещениеРаботниковОрганизаций/КадровоеПеремещениеРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровоеПеремещениеРаботниковОрганизаций</name>
  <registerRecords>InformationRegister.РаботникиОрганизации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеСтарое</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьСтарая</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПеремещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботыСтарый</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетВПроектнойДеятельности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяРольСотрудникаСтарая</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяРольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеНачислениеСтарое</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеНачисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/РаботникиОрганизации/РаботникиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетВПроектнойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыФизЛиц/ДополнительныеПараметрыФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыФизЛиц</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнаяРольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.КадровоеПеремещениеРаботниковОрганизаций</types>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СостояниеРаботникаОрганизации/СостояниеРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеРаботникаОрганизации</name>
  <enumValues>
    <name>ПринятНаРаботуВОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/КадровоеПеремещениеРаботниковОрганизаций/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ДатаПланирования) Тогда
		ВремяСмещения = Час(Дата) * 3600 + Минута(Дата) * 60 + Секунда(Дата);
	Иначе
		ВремяСмещения = 0;
	КонецЕсли;
	
	НомерСтроки = 0;
	// регистр РаботникиОрганизации
	Движения.РаботникиОрганизации.Записывать = Истина;
	Движения.РаботникиОрганизации.Очистить();
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		НомерСтроки = НомерСтроки + 1;
		Движение = Движения.РаботникиОрганизации.Добавить();
		Если НомерСтроки = 1 Тогда
			Движение.Период = ТекСтрокаСотрудники.ДатаПеремещения + ВремяСмещения;
		Иначе
			Движение.Период = ТекСтрокаСотрудники.ДатаПеремещения;
		КонецЕсли;
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Подразделение = ТекСтрокаСотрудники.Подразделение;
		Движение.Должность = ТекСтрокаСотрудники.Должность;
		Движение.Состояние = Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию;
		Движение.ГрафикУчетаРабочегоВремени = ТекСтрокаСотрудники.ГрафикРаботы;
		Движение.УчаствуетВПроектнойДеятельности = ТекСтрокаСотрудники.УчаствуетВПроектнойДеятельности;
		//CeHbKA 13.05.2019 #3103
		Движение.ФизЛицо = ТекСтрокаСотрудники.ФизЛицо;
		Движение.Терминал = Терминал;
		//CeHbKA 13.05.2019 #3103
		//Асеев 20.03.2023 (Задача № 5015)>>>
		Движение.ОсновноеНачисление = ТекСтрокаСотрудники.ОсновноеНачисление;
		//Асеев 20.03.2023 (Задача № 5015)<<<
	КонецЦикла;
	
	НомерСтроки = 0;
	//Переварюха В.В. Задача № 3649 08.11.2019
	Для каждого Сотрудник Из Сотрудники Цикл
		НомерСтроки = НомерСтроки + 1;
		Если ЗначениеЗаполнено(Сотрудник.ОсновнаяРольСотрудника) Тогда
			
			Если НомерСтроки = 1 Тогда
				ПериодПеремещения = Сотрудник.ДатаПеремещения + ВремяСмещения;
			Иначе
				ПериодПеремещения = Сотрудник.ДатаПеремещения;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ДополнительныеПараметрыФизЛиц.СоздатьНаборЗаписей();
			//Геннадий #4397 02.04.2021 ->
			НаборЗаписей.Отбор.Период.Установить(ПериодПеремещения);//Дата);
			//Геннадий #4397 02.04.2021 <-
			НаборЗаписей.Отбор.ФизЛицо.Установить(Сотрудник.ФизЛицо);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				Запись = НаборЗаписей.Добавить();
				//Геннадий #4397 02.04.2021 ->
				Запись.Период = ПериодПеремещения;//Дата);
				//Геннадий #4397 02.04.2021 <-
				Запись.ФизЛицо = Сотрудник.ФизЛицо;
				Запись.ОсновнаяРольСотрудника = Сотрудник.ОсновнаяРольСотрудника;
				Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				Запись.ДокументРегистратор = Ссылка;
			Иначе
				Для каждого Запись Из НаборЗаписей Цикл
					Если Запись.ДокументРегистратор = Ссылка Тогда
						Запись.ОсновнаяРольСотрудника = Сотрудник.ОсновнаяРольСотрудника;
						Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЦикла;	
	//Переварюха В.В. Задача № 3649 08.11.2019
		
КонецПроцедуры

//Миго-групп{
//Усманов В.И.
//22.12.2017 
//++++++++++++++++++++++++
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаПланирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Сообщить("Необходимо отменить проведение документа для изменения данных");
		Отказ = Истина;
		Возврат;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения или РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураНеизвестный = Новый Структура("ПодразделениеСтарое,ДолжностьСтарая", Справочники.Подразделения.ПустаяСсылка(), Справочники.ДолжностиОрганизаций.ПустаяСсылка());
	СтрокиСотрудники = Сотрудники.НайтиСтроки(СтруктураНеизвестный);
	Если СтрокиСотрудники.Количество() Тогда
		Для Каждого СтрокаСотрудника Из СтрокиСотрудники Цикл
			Сообщить("Неизвестный сотрудник в строке " + СтрокаСотрудника.НомерСтроки);
		КонецЦикла;
		Сообщить("Перемещение может быть внесено только по сотрудникам, которые ранее были приняты на работу!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаботникиОрганизации.Регистратор КАК Регистратор,
	|	РаботникиОрганизации.Подразделение КАК Подразделение,
	|	РаботникиОрганизации.Должность КАК Должность,
	|	РаботникиОрганизации.ГрафикУчетаРабочегоВремени КАК ГрафикУчетаРабочегоВремени,
	|	РаботникиОрганизации.Состояние КАК Состояние,
	|	ДЕНЬГОДА(Работники.ДатаСобытия) КАК РегистраторДата,
	|	Работники.Организация КАК Организация,
	|	Работники.ДатаСобытия КАК ДатаСобытия,
	|	Работники.Сотрудник КАК Сотрудник
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(РаботникиОрганизации.Период) КАК ДатаСобытия,
	|		РаботникиОрганизации.Организация КАК Организация,
	|		РаботникиОрганизации.Сотрудник КАК Сотрудник
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизации.СрезПоследних(&Период, Сотрудник В (&Сотрудник)) КАК РаботникиОрганизации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаботникиОрганизации.Организация,
	|		РаботникиОрганизации.Сотрудник) КАК Работники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|		ПО Работники.ДатаСобытия = РаботникиОрганизации.Период
	|			И Работники.Организация = РаботникиОрганизации.Организация
	|			И Работники.Сотрудник = РаботникиОрганизации.Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудники.ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("Период",);
	
	Принят = Перечисления.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию;
	Уволен = Перечисления.СостояниеРаботникаОрганизации.Уволен;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Для каждого Строка Из Сотрудники Цикл
				Если НЕ Проведен Тогда
					Если Выборка.Сотрудник = Строка.Сотрудник Тогда
						Если Выборка.Организация = Организация Тогда
							Если НЕ Выборка.ДатаСобытия>Строка.ДатаПеремещения Тогда 
								Если Выборка.Состояние = Уволен Тогда	
								ИначеЕсли Выборка.Состояние = Принят Тогда
									Если ДеньГода(Строка.ДатаПеремещения) = выборка.РегистраторДата Тогда
										Если НЕ Проведен Тогда
											Сообщить("Сотрудник "+Строка.Сотрудник+" принят документом "+Выборка.Регистратор+". Проведение документа запрещено. Перевод сотрудника возможен на следующие сутки после даты приема на работу.");
											Отказ = Истина;
										КонецЕсли; 
									//ИначеЕсли ДеньГода(Строка.ДатаПеремещения) >выборка.РегистраторДата Тогда
									//	Если Выборка.Должность = Строка.Должность Тогда
									//		Если Выборка.Подразделение = Строка.Подразделение Тогда
									//			Если Выборка.ГрафикУчетаРабочегоВремени = Строка.ГрафикРаботы Тогда
									//				Сообщить ("Сотрудник "+Строка.Сотрудник+ " уже принят в эту организацию с такими данными. Проведение документа запрещено.");
									//				Отказ = Истина;
									//			КонецЕсли; 
									//		КонецЕсли; 
									//	КонецЕсли;
									КонецЕсли;
								Иначе
									Если не проведен Тогда
										Сообщить ("Сотрудник "+Строка.Сотрудник+" принят в несколько организаций."); 
									КонецЕсли; 
								КонецЕсли;
							Иначе 
								Сообщить("Проведение документа ранее даты последнего действия по сотруднику выполнить не возможно. Распроведите все документы.");
								Отказ = Истина;
							КонецЕсли; 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла; 
	КонецЕсли; 
	//Отказ = Ложь;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
		
	//Геннадий #4397 02.04.2021 ->
	//новые записи будут на начало дня, иначе при отмене проведения или перепроведении старого документа, в РС могут остаться неактуальные записи
	ОчиститьДвиженияПоРСДополнительныеПараметрыЗаказа();
	//Геннадий #4397 02.04.2021 <-
	
	////Переварюха В.В. Задача № 3649 08.11.2019
	//Для каждого Сотрудник Из Сотрудники Цикл
	//	
	//	НаборЗаписей = РегистрыСведений.ДополнительныеПараметрыФизЛиц.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Период.Установить(Дата);
	//	НаборЗаписей.Отбор.ФизЛицо.Установить(Сотрудник.ФизЛицо);
	//	НаборЗаписей.Прочитать();
	//	
	//	Если НаборЗаписей.Количество() > 0 Тогда
	//	Для каждого Запись Из НаборЗаписей Цикл
	//		Если Запись.ДокументРегистратор = Ссылка Тогда
	//			НаборЗаписей.Удалить(НаборЗаписей[Запись.НомерСтроки]);
	//		КонецЕсли;
	//	КонецЦикла;
	//	КонецЕсли;
	//
	//	НаборЗаписей.Записать();
	//	
	//КонецЦикла;	
	////Переварюха В.В. Задача № 3649 08.11.2019

КонецПроцедуры
//------------------------
//Миго-групп}

//Геннадий #4397 02.04.2021 ->
Функция ОчиститьДвиженияПоРСДополнительныеПараметрыЗаказа() Экспорт
	
	ВыборкаДетальныеЗаписи = ПолучитьДанныеРСПоДокументу();
	Если ВыборкаДетальныеЗаписи <> Неопределено Тогда
		
		//очистим имеющиеся записи в РС, потом запишем заново
		ВыборкаДетальныеЗаписи.Сбросить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ДополнительныеПараметрыФизЛиц.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
			НаборЗаписей.Отбор.ФизЛицо.Установить(ВыборкаДетальныеЗаписи.ФизЛицо);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				Для каждого Запись Из НаборЗаписей Цикл
					Если Запись.ДокументРегистратор = Ссылка Тогда
						НаборЗаписей.Удалить(НаборЗаписей[Запись.НомерСтроки]);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьДанныеРСПоДокументу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеПараметрыФизЛиц.Период КАК Период,
		|	ДополнительныеПараметрыФизЛиц.ФизЛицо КАК ФизЛицо,
		|	ДополнительныеПараметрыФизЛиц.ОсновнаяРольСотрудника КАК ОсновнаяРольСотрудника,
		|	ДополнительныеПараметрыФизЛиц.ДокументРегистратор КАК ДокументРегистратор
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыФизЛиц КАК ДополнительныеПараметрыФизЛиц
		|ГДЕ
		|	ДополнительныеПараметрыФизЛиц.ДокументРегистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи; 	
	Иначе
		Возврат Неопределено; 	
	КонецЕсли;
	
КонецФункции
//Геннадий #4397 02.04.2021 <-
